STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/app_ble.c
  Adv_Request(APP_BLE_FAST_ADV);
#else
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_SCAN_REQ_ID, CFG_SCH_PRIO_0);

#endif

  return;
}


SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  uint8_t index;

  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  switch (event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      evt_blecore_aci *blecore_evt;

      blecore_evt = (evt_blecore_aci*) event_pckt->data;

      switch (blecore_evt->ecode)
      {
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blecore_evt->data;

          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if ((gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC) &&
              (gap_evt_proc_complete->Status == 0x00))
          {
            BSP_LED_Off(LED_BLUE);
            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n");
            if(BleApplicationContext.DeviceServerFound == 0x01)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_REQ_ID, CFG_SCH_PRIO_0);
            }
          }
        }
        break; /* ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
      }
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 * disconnection_complete_event;

      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      APP_DBG_MSG("HCI_DISCONNECTION_COMPLETE_EVT_CODE for connection handle 0x%x\n",
                  disconnection_complete_event->Connection_Handle);
      /* Find index of the handle deconnected */
      index = 0;
      while((index < CFG_MAX_CONNECTION)
          && (BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index]
                                                                                  != disconnection_complete_event->Connection_Handle))
      {
        index++;
      }

      if (index < CFG_MAX_CONNECTION)
      {
        APP_DBG_MSG("Index of the handle deconnected: %d\n", index);
        BleApplicationContext.Device_Connection_Status[index] = APP_BLE_IDLE;
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] = 0xFFFF;
      }
      else
        APP_DBG_MSG("No index found for the handle discconnected !\n");

#if(GATT_CLIENT == 0)
      /* restart advertising */
      Adv_Request(APP_BLE_FAST_ADV);
#endif
    }
    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;

      switch (meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 * connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          HW_TS_Stop(BleApplicationContext.Connection_mgr_timer_Id);

          APP_DBG_MSG("HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE for connection handle 0x%x\n",
                      connection_complete_event->Connection_Handle);

          /* Find index of a connection not in APP_BLE_IDLE, APP_BLE_CONNECTED_SERVER or APP_BLE_CONNECTED_CLIENT state */
          index = 0;
          while((index < CFG_MAX_CONNECTION) &&
              ((BleApplicationContext.Device_Connection_Status[index] == APP_BLE_IDLE)             ||
                  (BleApplicationContext.Device_Connection_Status[index] == APP_BLE_CONNECTED_SERVER) ||
                  (BleApplicationContext.Device_Connection_Status[index] == APP_BLE_CONNECTED_CLIENT)))
          {
            index++;
          }

          if (index < CFG_MAX_CONNECTION)
          {
            APP_DBG_MSG("First index in state %d: %d\n",
                        BleApplicationContext.Device_Connection_Status[index],
                        index);
            if (BleApplicationContext.Device_Connection_Status[index] == APP_BLE_LP_CONNECTING)
            {
              /* Connection as client */
              BleApplicationContext.Device_Connection_Status[index] = APP_BLE_CONNECTED_CLIENT;
            }
            else
            {
              /* Connection as server */
              BleApplicationContext.Device_Connection_Status[index] = APP_BLE_CONNECTED_SERVER;
            }
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] =
                connection_complete_event->Connection_Handle;
          }
          else
            APP_DBG_MSG("No stored connection in state different than APP_BLE_IDLE, APP_BLE_CONNECTED_CLIENT and APP_BLE_CONNECTED_SERVER!\n");

#if (GATT_CLIENT == 1)
          {
            tBleStatus result;

            APP_DBG_MSG("aci_gatt_disc_all_primary_services\n");
            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index]);
            if( result == BLE_STATUS_SUCCESS )
            {
              APP_DBG_MSG("Discovery of all primary services sent Successfully \n");
            }
            else
            {
              APP_DBG_MSG("Discovery of all primary services sent Failed with error: 0x%x\n", result);
            }
          }
#endif
        }
        break; /* HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
        {
          hci_le_advertising_report_event_rp0 * le_advertising_event;
          uint8_t event_type, event_data_size;
          uint8_t adtype, adlength;
          uint8_t *adv_report_data; 
          uint8_t k;

          le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;
          
          /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure. 
          The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
          Instead they must be read by using offsets (please refer to BLE specification).
          RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
          */
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

          if (event_type == ADV_IND)
          {
            /*ISOLATION OF BD ADDRESS AND LOCAL NAME*/

            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              APP_DBG_MSG("adlength: 0x%X\n",
                          adlength);
              adtype = adv_report_data[k + 1];
              APP_DBG_MSG("adtype: 0x%X\n",
                          adtype);
              switch (adtype)
              {
                case AD_TYPE_FLAGS: /* now get flags */
                {
                  uint8_t i;

                  APP_DBG_MSG("AD_TYPE_FLAGS: 0x");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                }
                break;

                case AD_TYPE_COMPLETE_LOCAL_NAME:
                {
                  uint8_t i;

                  APP_DBG_MSG("AD_TYPE_COMPLETE_LOCAL_NAME: ");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%c",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                }
                break;

