STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/app_ble.c
                case AD_TYPE_16_BIT_SERV_UUID:
                {
                  uint8_t i;
                  uint16_t uuid16;

                  APP_DBG_MSG("AD_TYPE_16_BIT_SERV_UUID: 0x");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                  uuid16 = (adv_report_data[k + 2 + 1] << 8) +
                      adv_report_data[k + 2 + 0];
                  if(uuid16 == CRS_SERVICE_UUID)
                  {
                    APP_DBG_MSG("-- Cable Replacement Service DETECTED -- VIA 16 bits UUID\n");
                    BleApplicationContext.DeviceServerFound = 0x01;
                    APP_DBG_MSG("SERVER_REMOTE_BDADDR: 0x\n");
                    for(i = 0; i < 5; i++)
                    {
                      SERVER_REMOTE_BDADDR[i] = le_advertising_event->Advertising_Report[0].Address[i];
                      APP_DBG_MSG("%X",
                                  le_advertising_event->Advertising_Report[0].Address[i]);
                    }
                    APP_DBG_MSG("\n");
                  }
                }
                break;

                case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
                {
                  uint8_t i;

                  APP_DBG_MSG("AD_TYPE_TX_POWER_LEVEL: 0x");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                }
                break;

                case AD_TYPE_128_BIT_SERV_UUID:
                {
                  uint8_t i, result = TRUE;

                  APP_DBG_MSG("AD_TYPE_128_BIT_SERV_UUID: 0x");
                  for(i = 0; i < adlength-1; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                    if(CRS_STM_UUID[i] != adv_report_data[k + 2 + i])
                    {
                      APP_DBG_MSG("CRS_STM_UUID[%d] 0x%x != adv_report_data[%d + 2 + %d] 0x%x\n",
                                  i, CRS_STM_UUID[i], k, i, adv_report_data[k + 2 + i]);
                      APP_DBG_MSG("AD_TYPE_128_BIT_SERV_UUID not a Cable Replacement Service\n");
                      result = FALSE;
                      break;
                    }
                  }
                  APP_DBG_MSG("\n");
                  if(result == TRUE)
                  {
                    APP_DBG_MSG("-- Cable Replacement Service DETECTED -- VIA 128 bits UUID\n");
                    BleApplicationContext.DeviceServerFound = 0x01;
                    APP_DBG_MSG("SERVER_REMOTE_BDADDR: 0x");
                    for(i = 0; i < 6; i++)
                    {
                      SERVER_REMOTE_BDADDR[i] = le_advertising_event->Advertising_Report[0].Address[i];
                      APP_DBG_MSG("%X",
                                  le_advertising_event->Advertising_Report[0].Address[i]);
                    }
                    APP_DBG_MSG("\n");
                  }
                }
                break;

                case AD_TYPE_SERV_SOLICIT_16_BIT_UUID_LIST: /* 16 bit Service UUIDs list */
                {
                  uint8_t i;

                  APP_DBG_MSG("AD_TYPE_SERV_SOLICIT_16_BIT_UUID_LIST: 0x");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                }
                break;

                case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufactureur Specific */
                {
                } /* AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
                break;

                case AD_TYPE_SERVICE_DATA: /* service data 16 bits */
                {
                  uint8_t i;

                  APP_DBG_MSG("AD_TYPE_SERVICE_DATA: 0x");
                  for(i = 0; i < adlength; i++)
                  {
                    APP_DBG_MSG("%X",
                                adv_report_data[k + 2 + i]);
                  }
                  APP_DBG_MSG("\n");
                }
                break;

                default:
                  break;
              } /* End switch (adtype) */
              k += adlength + 1;
            } /* End while(k < event_data_size) */
          } /* End if (event_type == ADV_IND) */
        }
        break; /* HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE */

        default:
          break;
      }
    }
    break; /* HCI_LE_META_EVT_CODE */

    default:
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status(uint16_t Connection_Handle)
{
  uint8_t index;

  /* Find index of the handle */
  index = 0;        
  while((index < CFG_MAX_CONNECTION) &&
      (BleApplicationContext.BleApplicationContext_legacy.connectionHandle[index] != Connection_Handle))
  {
    index++;
  }

  if(index == CFG_MAX_CONNECTION)
  {
    APP_DBG_MSG("No 0x%x connection handle found in table !\n", Connection_Handle);
    return APP_BLE_IDLE;
  }
  else
  {
    APP_DBG_MSG("Found 0x%x connection handle in table at index: %d!\n", Connection_Handle, index);
    return BleApplicationContext.Device_Connection_Status[index];
  }
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  uint8_t index;

  /* Find index in connected state */
  index = 0;        
  while((index < CFG_MAX_CONNECTION) &&
      (BleApplicationContext.Device_Connection_Status[index] == APP_BLE_IDLE))
  {
    index++;
  }

  if(index == CFG_MAX_CONNECTION)
  {
    return APP_BLE_IDLE;
  }
  else
  {
    return BleApplicationContext.Device_Connection_Status[index];
  }
}

void APP_BLE_Key_Button1_Action(void)
{
}

void APP_BLE_Key_Button2_Action(void)
{
}

